app/controllers/api/v1/landmarks_controller.rb

    def index
        landmarks = Landmark.all
---
SELECT "landmarks".* FROM "landmarks"

    def create
        landmark = Landmark.create!(landmark_params)
---
INSERT INTO "landmarks" ("user_id", "name", "address", "img_url", "bio", "genre", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

    def show
        landmark = Landmark.find(params[:id])
---
SELECT "landmarks".* FROM "landmarks" WHERE "landmarks"."id" = $1 LIMIT $2  [["id", 30], ["LIMIT", 1]]