app/controllers/api/v1/users_controller.rb

    def create
        user = User.create!(user_params)
---
INSERT INTO "users" ("username", "hometown", "img_url", "bio", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["username", "Karina"], ["hometown", "Brooklyn"], ["img_url", "image"], ["bio", "msakdnkals"], ["created_at", "2020-12-01 20:21:36.952748"], ["updated_at", "2020-12-01 20:21:36.952748"]]